{
    "pageTitle": "Experiences",
    "experiences": [
        {   
            "title": [
                "Vertify Technologies",
                "Front-end Developer/UI-UX Designer",
                "Oct 2024 - Present"
            ],
            "content": [
                {
                    "title": "Technology Stack",
                    "body": "React JS, Tailwind CSS, GitHub Actions, Figma"
                },
                {
                    "title": "Organization’s Activities",
                    "body": "Vertify technologies is a startup based in Sri Lanka, whihch is currently developing the countries first appointment booking platform for businesses and individuals. I am a part of the team that is developing this platform from scratch."
                },
                {
                    "title": "My Responsibilities",
                    "body": [
                        {
                            "body": "Developed and currently maintaining the company website using React, Tailwind CSS, and Aceternity UI."
                        },
                        {
                            "body": "Implemented a CI/CD pipeline with GitHub Actions for the deployment of the application to AWS. Led the UI/UX design for the company’s inaugural product, 'Khrono', Sri Lanka's first appointment booking system."
                        },
                        {
                            "body": "Leading the front-end code reviews for Khrono, covering both the React Native mobile app and the React web dashboard"
                        }
                    ],
                    "links": [
                        {
                            "title": "Visit Vertify Technologies Webpage",
                            "link": "https://www.v-tfy.com/"
                        }
                    ]
                },
                {
                    "title": "My Accomplishments",
                    "body": [
                        {
                            "body": "I designed the UI/UX design of the Khrono mobile application. I also implemented the authentication feature for the web dashboard of “Khrono”, using Asgardeo with React. I am also leading the front-end code reviews for Khrono, covering both the React Native mobile app and the React web dashboard."
                        },
                        {
                            "body": "Also I am leading the front-end code reviews for Khrono, covering both the React Native mobile app and the React web dashboard."
                        }
                    ]
                },
                {
                    "title": "Challenges Faced",
                    "body": "This was the first time I got this many responsibilities in my profession career and I am considering this as a learning oppurtunity to continue to learn and grow my self."
                }
            ]
        },
        {   
            "title": [
                "KAST",
                "Senior Mobile Developer",
                "Dec 2024 - Present"
            ],
            "content": [
                {
                    "title": "Technology Stack",
                    "body": "Flutter, Figma"
                },
                {
                    "title": "Organization’s Activities",
                    "body": "KAST is a crytpo based startup which is backed by the Solana Founders, where we are currently developing and maintaing an internet banking like system for for crypto currencies like Solana, Ethereum, etc."
                },
                {
                    "title": "My Responsibilities",
                    "body": [
                        {
                            "body": "Leading the development of the design revamping effort of the company's main application, KAST Crypto Wallet, which has over 200K+ downloads across both Apple App Store and Google Play Store. I collaborate closely with the design team to develop a pixel-perfect UI."
                        },
                        {
                            "body": "• Implementing features like 'debit card buying' and 'debit card shipping' using the 'clean architecture' for KAST Crypto Wallet application."
                        }
                    ]
                },
                {
                    "title": "My Accomplishments",
                    "body": "I am currently leading the development of the design revamping effort of the company's main application, KAST Crypto Wallet, which has over 200K+ downloads across both Apple App Store and Google Play Store. I collaborate closely with the design team to develop a pixel-perfect UI."
                }
            ]
        },
        {   
            "title": [
                "WSO2",
                "Front-end Developer/UI-UX Designer",
                "May 2022 - Sep 2024"
            ],
            "content": [
                {
                    "title": "Technology Stack",
                    "body": "React JS, Figma, Next JS, Flutter, Android, Cypress E2E Test"
                },
                {
                    "title": "Organization’s Activities",
                    "body": "WSO2 is an open-source technology provider founded in 2005. It delivers software and cloud solutions that provide foundational technologies for application development and identity and access management. Their main products are Identity Server, Asgardeo, Choreo and Ballerina."
                },
                {
                    "title": "My Responsibilities",
                    "body": "During my time as a Front-end Developer/UI-UX Designer at WSO2, I worked with the Identity Access Management team. My primary responsibilities included front-end development and UI/UX design for the company's products, namely Identity Server and Asgardeo. For development and design tasks, I primarily utilized React JS, Next JS, Flutter, Android and Figma.",
                    "presentations": [
                        {
                            "link": "https://www.youtube.com/embed/0GZfKLJE85U?si=1DgOm099bewnYwQz"
                        },
                        {
                            "link": "https://www.youtube.com/embed/FFDhYh9hAt4?si=9VBdNtCRSw-3AUO7"
                        }
                    ]
                },
                {
                    "title": "My Accomplishments",
                    "body": [
                        {
                            "body": "I was actively involved in the development of the latest features in WSO2 Identity Server version 7.0, where I contributed to developing the front end for features like 'API Authorization' using React JS. Additionally, I developed the latest Asgardeo-Android SDK, enabling Asgardeo (Identity as a Service) integration through 'app-native authentication' for Android applications. I also recently redesigned Asgardeo's home page and user registration flow."
                        },
                        {
                            "body": "Also I got an opportunity to present a session on 'Mastering Secure React Development for Enterprise' for the the undergraduates at Department of Computer Science and Engineering, University of Moratuwa, Sri Lanka. In this session, I discussed the best practices for developing secure React applications for enterprise use cases. I also shared insights on how to implement secure authentication and authorization mechanisms in React applications using Asgardeo."
                        },
                        {
                            "body": "During my time at WSO2, I was recognized as part of the top 20% of employees and acknowledged as one of the 'Rockstars' for my contributions to the tech landscape, particularly for my Medium articles highlighting the new Asgardeo-Android SDK."
                        }
                    ],
                    "images": [
                        {
                            "image": "/images/me/me-session-1.webp",
                            "alt": "achintha-session-1"
                        },
                        {
                            "image": "/images/me/me-session-2.webp",
                            "alt": "achintha-session-2"
                        }
                    ],
                    "links": [
                        {
                            "title": "Asgardeo Android SDK",
                            "link": "https://github.com/asgardeo/mobile-ui-sdks"
                        },
                        {
                            "title": "API Authorization feature of Asardeo",
                            "link": "https://wso2.com/asgardeo/docs/guides/authorization/api-authorization/api-authorization/"
                        },
                        {
                            "title": "Key features of the new WSO2 Identity Server 7.0",
                            "link": "https://wso2.com/library/blogs/7-key-features-of-wso2-identity-server-7-every-application-and-api-developer-should-know/"
                        },
                        {
                            "title": "Try out Asgardeo",
                            "link": "https://wso2.com/asgardeo/"
                        }
                    ]
                },
                {
                    "title": "Challenges Faced",
                    "body": "One of the main challenges I faced at WSO2 was adapting to the company's fast-paced work environment and the complexity of the products. However, with the support of my team members and the resources provided by the company, I was able to overcome these challenges and grow both professionally and personally."
                }
            ]
        },
        {   
            "title": [
                "Khrono (New Startup)",
                "Freelance Front-end Developer/UI-UX Designer:",
                "Oct 2024 - Present"
            ],
            "content": [
                {
                    "title": "Technology Stack",
                    "body": "Figma, Excalidraw, React, React Native"
                },
                {
                    "title": "Organization’s Activities",
                    "body": "Khrono is newly started startup that is developing an Appointment Booking System."
                },
                {
                    "title": "My Responsibilities",
                    "body": "Currently I am leading the UI/UX design efforts of the application. Currently we are in the wireframing which involves mapping out user journeys, designing layouts of the app, and ensuring that each feature meets the users’ needs. Additionally, I am developing features for the Khrono mobile app (React Native) and web dashboard (React) like authentication"
                }
            ]
        },
        {   
            "title": [
                "Sakura Speak AI",
                "Freelance Mobile Application Developer",
                "Sep 2024 - Oct 2024"
            ],
            "content": [
                {
                    "title": "Technology Stack",
                    "body": "Expo, React Native, Android, iOS"
                },
                {
                    "title": "Organization’s Activities",
                    "body": "Sakura Speak AI is a startup that is developing an AI-powered mobile application that helps users to learn Japanese language. Practice beginner-friendly conversations without pressure - you can make mistakes freely and get instant feedback."
                },
                {
                    "title": "My Responsibilities",
                    "body": "My main responsibility was to resolve the deployment issue with the initial alpha test version of Sakura Speak(developed using React Native[Expo]), a Japanese language learning app focused on interactive speaking exercises, on the Apple App Store. This issue was successfully fixed, allowing the app to be published for alpha testing. Additionally, I improved the app’s user interface design to create a more polished and user-friendly experience, optimizing it for users.",
                    "links": [
                        {
                            "title": "Test the initial version of the Sakura Speak AI app",
                            "link": "https://sakuraspeak.app/"
                        }
                    ]
                },
                {
                    "title": "Challenges Faced",
                    "body": "One of the main challenges I faced was that I hadn’t used React Native and Expo before, so I had to learn the technology while developing the application. I successfully overcame this by diving into the tech and applying it effectively to build the app."
                }
            ]
        },
        {   
            "title": [
                "Riora Innovations",
                "UI/UX Designer (Part-time)",
                "Feb 2021"
            ],
            "place": "Riora Innovations",
            "position": "UI/UX Designer",
            "duration": "Feb 2021",
            "content": [
                {
                    "title": "Technology Stack",
                    "body": "Figma, Excalidraw"
                },
                {
                    "title": "Organization’s Activities",
                    "body": "Riora Innovations is a software development company based in Sri Lanka that specializes in mobile application development. The company is known for its innovative solutions and commitment to delivering high-quality products to its clients."
                },
                {
                    "title": "My Responsibilities",
                    "body": "As a part-time UI/UX designer at Riora Innovations, I mainly involed on one of their projects called 'Organic Chemistry Conversions' game. My primary responsibilities were to design the user interface and user experience of the game. For design tasks, I primarily utilized Figma.",
                    "images": [
                        {
                            "image": "/images/projects/organic/organic-1.webp",
                            "key": "organic-1"
                        },
                        {
                            "image": "/images/projects/organic/organic-2.webp",
                            "key": "organic-2"
                        },
                        {
                            "image": "/images/projects/organic/organic-3.webp",
                            "key": "organic-3"
                        }
                    ],
                    "links": [
                        {
                            "title": "View more details of the project 'Organic Chemistry Conversions'",
                            "link": "projects/Organic%20Chemistry%20Conversions"
                        }
                    ]
                },
                {
                    "title": "My Accomplishments",
                    "body": "While certain constraints limited our application's launch exclusively to Android users, the outcome was better than expected. The application got exceptional reviews, achieving a rating of 4.6/5.0 with over 1,000 downloads in the Google Play store in a relatively brief span. These accomplishments were attained with minimal marketing efforts, emphasizing the application's appeal and impact."
                },
                {
                    "title": "Challenges Faced",
                    "body": "A main challenge I encountered was stepping into the realm of game development for the first time. This new experience required a comprehensive preliminary study. I delved into the intricacies of game creation, examining development processes and the essential considerations a designer must weigh while shaping a game."
                }
            ]
        },
        {   
            "title": [
                "Department of Computer Science & Engineering, University of Moratuwa",
                "Visiting Instructor",
                "Jul 2023 - Nov 2023 & Feb 2022 - Apr 2022"
            ],
            "place": "Department of Computer Science & Engineering, University of Moratuwa",
            "position": "Visiting Instructor",
            "duration": "Jul 2023 - Nov 2023 & Feb 2022 - Apr 2022",
            "content": [
                {
                    "title": "Organization’s Activities",
                    "body": "The Department of Computer Science & Engineering at the University of Moratuwa is a one of the most prestigious institution in Sri Lanka that offers a comprehensive range of undergraduate and postgraduate programs in computer science and engineering. The department is well-known for its academic excellence and commitment to creating innovation and research in the field of computer science."
                },
                {
                    "title": "My Responsibilities",
                    "body": "As a visiting instructor, my primary focus is on improving the students' learning experience. This involves creating tutorials to help students get started with web development, technologies, trends, and security concerns. Additionally, I guide students during practical sessions and  grading their assignments.",
                    "presentations": [
                        {
                            "link": "https://www.youtube.com/embed/videoseries?si=zj_nuEvPPHxcnmVt&amp;list=PLrkEOVQA1S7JQbxOxq7yf3IjH9C5U5dSv"
                        }
                    ]
                },
                {
                    "title": "My Accomplishments",
                    "body": "One of the most gratifying moments during my brief tenure was when I successfully assisted a struggling student in understanding a difficult topic within the module. Witnessing the student's progress was truly enlightening and rewarding."
                },
                {
                    "title": "Challenges Faced",
                    "body": "Throughout my time as a visiting instructor, the main challenge I encountered was determining the most effective ways to support and assist students. Initially, it was a difficult task, but as time passed, it became natural and enjoyable. This experience has improved my skills in communication, mentorship, and problem-solving, and I am grateful for the opportunity to contribute to the learning journey of aspiring computer science undergraduates."
                }
            ]
        },
        {   
            "title": [
                "Fcode Labs",
                "Software Engineer - Intern (UI/UX, Front-end)",
                "Oct 2020 - Apr 2021"
            ],
            "content": [
                {
                    "title": "Technology Stack",
                    "body": "Flutter, Figma, React"
                },
                {
                    "title": "Organization’s Activities",
                    "body": "Fcode Labs is a software development company based in Sri Lanka that specializes in mobile application development, web development, and UI/UX design. The company is known for its innovative solutions and commitment to delivering high-quality products to its clients."
                },
                {
                    "title": "My Responsibilities",
                    "body": "In my role as a front end developer and UI/UX Designer intern, my main responsibilities were in creative and technical aspects of mobile application development for the company. For development and design tasks, I primarily utilized Flutter, and Figma. "
                },
                {
                    "title": "My Accomplishments",
                    "body": "During my time at Fcode Labs, I was able to make significant contributions to the development of 'Workmate'. I played the main role in the design and development of the application, ensuring that it met the needs and expectations of users. Additionally, I was able to enhance my skills in mobile application development and UI/UX design, which have proven to be invaluable in my career. Additionally, developed the home page of a e-commerce site(React).",
                    "links": [
                        {
                            "title": "Workmate Pro by Fcode Labs",
                            "link": "https://www.youtube.com/watch?v=5VPcJP5fuEE"
                        }
                    ]
                },
                {
                    "title": "Challenges Faced",
                    "body": "The sudden transition to a work-from-home setup due to the pandemic presented a formidable challenge. However, with the help of the team, we were able to adapt quickly and effectively to continue our work."
                }
            ]
        },
        {   
            "title": [
                "Sieve - Privacy Wherever You Go",
                "User Interface and User Experience Designer",
                "Jul 2020 - Oct 2020"
            ],
            "content": [
                {
                    "title": "Technology Stack",
                    "body": "Adobe XD, Adobe Photoshop"
                },
                {
                    "title": "Organization’s Activities",
                    "body": "Sieve is a Singapore-based company with a primary mission of empowering consumers to make informed decisions concerning their digital privacy."
                },
                {
                    "title": "My Responsibilities",
                    "body": "In my role as a UI/UX Designer at Sieve, I had two primary responsibilities. Firstly, I designed a data privacy chatbot application, focusing on enhancing user experience and privacy features. Secondly, I revamped the design of the company's website, ensuring alignment with their vision and objectives. For these tasks, I primarily used Adobe XD and Adobe Photoshop."
                },
                {
                    "title": "My Accomplishments",
                    "body": "While at Sieve, I was able to make significant contributions to the design and development of the company's products. Other than that, I was able to work with a team of talented individuals from diverse cultural backgrounds, which provided me with valuable insights and experiences. My time at Sieve helped me improve my skills as a UI/UX designer and prepared me for future challenges in the field."
                },
                {
                    "title": "Challenges Faced",
                    "body": "One notable challenge during my time at Sieve was adapting to a collaborative environment with team members coming from diverse ethnic and cultural backgrounds. This presented a valuable learning experience that initially required adjustment. However, with the support of my colleagues, I asjusted to this enriching work environment."
                }
            ]
        }
    ]
}